[
    {
        "img": "Assets/Images/Creating Detailed Specifications Icon.png",
        "heading": "1. Select your Specifications",
        "body": "Your approved plans detail the shell of your extension and may include crucial construction details your builder needs. What goes into the space you’re creating such as the type of flooring, lighting, heating etc. are referred to as your “Specifications”. These details are important as it enables your builders to understand the full scope of works involved. With this detail they can provide you with an accurate quote. Selecting your Specifications with BuildBuddy is an easy-to-follow step-by-step process. You will be guided along the way about your options to make informed decisions. Once you’re done you will have a detailed scope of work to share with builders."
    },

    {
        "img": "Assets/Images/Creating Detailed Specifications Icon.png",
        "heading": "2. Product Selection",
        "body": "Once you know what is going to be included within the scope of your extension then it’s time to start the product selection process. A typical single-storey extension will require you to purchase between 50-100 different products, from light fittings to kitchen appliances, flooring and much more. [See a typical list of products for a single storey extension]. BuildBuddy turns this complex task into a seamless process, helping you find products that fit your specifications and budget."
    },

    {
        "img": "Assets/Images/Creating Detailed Specifications Icon.png",
        "heading": "3. Engaging Your Builder",
        "body": "Once your specifications and product selections are complete, you're ready to engage your builder. Providing a comprehensive project breakdown removes the guesswork and enables your builder to provide a precise quote. This clarity makes comparisons between quotes much easier and eliminates unforeseen costs. Builders love this about BuildBuddy—it simplifies communication and ensures they're fully aligned with your vision."
    },

    {
        "img": "Assets/Images/Creating Detailed Specifications Icon.png",
        "heading": "4. Budgeting & Cash Flow Management",
        "body": "Beyond planning, BuildBuddy assists you in managing your budget. From the specification stage to engaging your builder, we provide a clear view of your cash flow. This way, your project stays financially on track from start to finish."
    },

    {
        "img": "Assets/Images/Creating Detailed Specifications Icon.png",
        "heading": "Throughout Your Journey: Task Management",
        "body": "Home extensions involve a myriad of tasks and decision points. BuildBuddy's interactive checklist and comprehensive knowledge base keep you organized and informed, ensuring a smooth, stress-free journey."
    }
]